### SQL and SQLite

In [2]:
import sqlite3

In [3]:
## Connect to an SQLite database (or create it if it doesn't exist) 
conn = sqlite3.connect('example.db')
conn

In [4]:
## Create a cursor object to interact with the database
cursor = conn.cursor()

In [7]:
## create a new table 
cursor.execute(
    '''
    CREATE TABLE IF NOT EXISTS employees (  
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    age INTEGER,
    department TEXT
    )
    '''
)

## commit the changes  
conn.commit()

In [8]:
cursor.execute(
    '''
    SELECT * FROM employees
    '''
)

In [9]:
## insert some data into the table
cursor.execute(
    ''' 
    INSERT INTO employees (name, age, department)
    VALUES ('Alice', 30, 'HR'),
           ('Bob', 25, 'Engineering'),
           ('Charlie', 35, 'Sales')        
    
    '''
)
conn.commit()

In [11]:
## Query the data   
cursor.execute(
    '''
    SELECT * FROM employees
    '''
)   
results = cursor.fetchall()
## Print the results
for row in results:
    print(row)

(1, 'Alice', 30, 'HR')
(2, 'Bob', 25, 'Engineering')
(3, 'Charlie', 35, 'Sales')

In [12]:
## update the data in table
cursor.execute(
    '''
    UPDATE employees
    SET age = 31
    WHERE name = 'Alice'
    '''
)
conn.commit()

In [13]:
## print the updated data
cursor.execute(
    '''
    SELECT * FROM employees
    '''
)
results = cursor.fetchall()
for row in results:
    print(row)

(1, 'Alice', 31, 'HR')
(2, 'Bob', 25, 'Engineering')
(3, 'Charlie', 35, 'Sales')

In [14]:
## delete a record
cursor.execute(
    '''
    DELETE FROM employees
    WHERE name = 'Bob'
    '''
)
conn.commit()

In [15]:
## Fetch all results
cursor.execute(
    '''
    SELECT * FROM employees
    '''
)
results = cursor.fetchall()
for row in results:
    print(row)

(1, 'Alice', 31, 'HR')
(3, 'Charlie', 35, 'Sales')

In [16]:
## Working With Sales Data
# Connect to an SQLite database
connection = sqlite3.connect('sales_data.db')
cursor = connection.cursor()

# Create a table for sales data
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales (
    id INTEGER PRIMARY KEY,
    date TEXT NOT NULL,
    product TEXT NOT NULL,
    sales INTEGER,
    region TEXT
)
''')

# Insert data into the sales table
sales_data = [
    ('2023-01-01', 'Product1', 100, 'North'),
    ('2023-01-02', 'Product2', 200, 'South'),
    ('2023-01-03', 'Product1', 150, 'East'),
    ('2023-01-04', 'Product3', 250, 'West'),
    ('2023-01-05', 'Product2', 300, 'North')
]

cursor.executemany('''
Insert into sales(date,product,sales,region)
                   values(?,?,?,?)
''',sales_data)

connection.commit()

In [17]:
## Fetch all results
cursor.execute(
    '''
    SELECT * FROM sales
    '''
)
results = cursor.fetchall()
for row in results:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product3', 250, 'West')
(5, '2023-01-05', 'Product2', 300, 'North')

In [18]:
conn.close()
connection.close()